{
  "bug_id": "BUG-048",
  "title": "TUI flickers on every keystroke when Claude Code is detected",
  "component": "tui",
  "severity": "high",
  "priority": "P1",
  "status": "in_progress",
  "reported_date": "2026-01-16",
  "updated_date": "2026-01-16",
  "assigned_to": null,
  "tags": ["tui", "claude-code", "rendering", "performance"],
  "affected_versions": [],
  "environment": "All platforms",
  "reproducibility": "always",
  "description": "Once Claude Code is detected in a pane, the TUI flickers excessively. Partially fixed in commit 40402d1 - analyze() now only returns state on actual changes. However, the spinner animation during 'Thinking...' state still causes rapid state transitions that trigger redraws.",
  "steps_to_reproduce": [
    "Start ccmux and attach to a session",
    "Launch Claude Code in a pane (claude-code or cc)",
    "Wait for Claude Code to be detected",
    "Submit a prompt and observe during thinking/processing",
    "Note: keystroke flicker is fixed, but spinner animation still flickers"
  ],
  "expected_behavior": "TUI should only redraw when meaningful state changes occur, not on spinner animation frames",
  "actual_behavior": "TUI flickers during thinking/processing state due to spinner animation triggering state changes",
  "evidence": {
    "type": "file",
    "location": "ccmux-server/src/agents/claude/mod.rs",
    "description": "Lines 127-143: analyze() fixed to return state only on changes, but spinner animation in terminal output still triggers rapid activity state transitions"
  },
  "root_cause": "The spinner animation (pulsing snowflake/flower that expands and contracts down to a dot) in Claude's terminal output causes the inner detector to report activity state changes on each frame, which then triggers PaneStateChanged broadcasts. Need to debounce or suppress spinner-induced state changes.",
  "impact": "Reduced from severe to moderate - keystroke flicker fixed, but processing state still has visual noise",
  "related_items": ["FEAT-084", "FEAT-082"],
  "partial_fix": {
    "commit": "40402d1",
    "description": "Fixed analyze() to only return state on actual changes (initial detection or activity transitions)",
    "remaining": "Spinner animation still causes rapid state transitions that need debouncing or suppression"
  }
}
